title: Scheduled Task 
id: #uuid
status: experimental
description: To find scheduled tasks
author: pranaynidhi
date: 18/12/2022

logsource:
    product: windows
    service: sysmon
    category: process_creation

detection:
    selection:
        EventID:
          - 1
        Image|endswith:
          - schtasks.exe
        CommandLine|contains|all:
          - schtasks
          - /create

    condition: selection

falsepositives:

level: low

tags:
    - {attack.tactic}
    - {attack.technique}
