title: Software Discovery
id: #uuid
status: experimental
description: To find softwares
author: pranaynidhi
date: 18/12/2022

logsource:
    product: windows
    service: sysmon
    category: process_creation

detection:
    selection:
        EventID:
          - 1
        Image|endswith:
          - reg.exe
        CommandLine|contains|all:
          - query
          - /v
          - svcVersion

    condition: selection

falsepositives:

level: low

tags:
    - {attack.tactic}
    - {attack.technique}
